#### Terraform Initialization ⚙️`success`
#### Terraform Apply 📖`success`

<details><summary>Show Apply</summary>

```terraform
[0m[1maws_dynamodb_table.idol_table: Refreshing state... [id=idolGroupList][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
[31m-[0m/[32m+[0m destroy and then create replacement
[0m
Terraform will perform the following actions:

[1m  # aws_dynamodb_table.idol_table[0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_dynamodb_table" "idol_table" {
      [33m~[0m [0m[1m[0marn[0m[0m              = "arn:aws:dynamodb:ap-northeast-1:526378883024:table/idolGroupList" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mhash_key[0m[0m         = "IdolType" [33m->[0m [0m"idolIdentifer" [31m# forces replacement[0m[0m
      [33m~[0m [0m[1m[0mid[0m[0m               = "idolGroupList" [33m->[0m [0m(known after apply)
        [1m[0mname[0m[0m             = "idolGroupList"
      [33m~[0m [0m[1m[0mrange_key[0m[0m        = "IdolName" [33m->[0m [0m"dataType" [31m# forces replacement[0m[0m
      [33m~[0m [0m[1m[0mread_capacity[0m[0m    = 0 [33m->[0m [0m(known after apply)
      [32m+[0m [0m[1m[0mstream_arn[0m[0m       = (known after apply)
      [31m-[0m [0m[1m[0mstream_enabled[0m[0m   = false [90m->[0m [0m[90mnull[0m[0m
      [32m+[0m [0m[1m[0mstream_label[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mstream_view_type[0m[0m = (known after apply)
      [31m-[0m [0m[1m[0mtags[0m[0m             = {} [90m->[0m [0m[90mnull[0m[0m
      [33m~[0m [0m[1m[0mtags_all[0m[0m         = {} [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mwrite_capacity[0m[0m   = 0 [33m->[0m [0m(known after apply)
        [90m# (1 unchanged attribute hidden)[0m[0m

      [31m-[0m [0mattribute {
          [31m-[0m [0m[1m[0mname[0m[0m = "IdolName" [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mtype[0m[0m = "S" [90m->[0m [0m[90mnull[0m[0m
        }
      [31m-[0m [0mattribute {
          [31m-[0m [0m[1m[0mname[0m[0m = "IdolType" [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mtype[0m[0m = "S" [90m->[0m [0m[90mnull[0m[0m
        }
      [31m-[0m [0mattribute {
          [31m-[0m [0m[1m[0mname[0m[0m = "UserDefinedIdolCategory" [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mtype[0m[0m = "S" [90m->[0m [0m[90mnull[0m[0m
        }
      [32m+[0m [0mattribute {
          [32m+[0m [0m[1m[0mname[0m[0m = "dataType"
          [32m+[0m [0m[1m[0mtype[0m[0m = "S"
        }
      [32m+[0m [0mattribute {
          [32m+[0m [0m[1m[0mname[0m[0m = "dataValue"
          [32m+[0m [0m[1m[0mtype[0m[0m = "S"
        }
      [32m+[0m [0mattribute {
          [32m+[0m [0m[1m[0mname[0m[0m = "idolIdentifer"
          [32m+[0m [0m[1m[0mtype[0m[0m = "S"
        }

      [31m-[0m [0mglobal_secondary_index {
          [31m-[0m [0m[1m[0mhash_key[0m[0m           = "IdolName" [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mname[0m[0m               = "getByIdolName" [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mnon_key_attributes[0m[0m = [
              [31m-[0m [0m"getByUserDefinedCategory",
              [31m-[0m [0m"spotifyApiUrl",
              [31m-[0m [0m"spotifyClientUrl",
              [31m-[0m [0m"spotifyId",
            ] [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mprojection_type[0m[0m    = "INCLUDE" [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mread_capacity[0m[0m      = 0 [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mwrite_capacity[0m[0m     = 0 [90m->[0m [0m[90mnull[0m[0m
        }
      [31m-[0m [0mglobal_secondary_index {
          [31m-[0m [0m[1m[0mhash_key[0m[0m           = "UserDefinedIdolCategory" [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mname[0m[0m               = "getByUserDefinedCategory" [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mnon_key_attributes[0m[0m = [
              [31m-[0m [0m"IdolName",
              [31m-[0m [0m"spotifyApiUrl",
              [31m-[0m [0m"spotifyClientUrl",
              [31m-[0m [0m"spotifyId",
            ] [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mprojection_type[0m[0m    = "INCLUDE" [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mread_capacity[0m[0m      = 0 [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mwrite_capacity[0m[0m     = 0 [90m->[0m [0m[90mnull[0m[0m
        }
      [32m+[0m [0mglobal_secondary_index {
          [32m+[0m [0m[1m[0mhash_key[0m[0m           = "dataType"
          [32m+[0m [0m[1m[0mname[0m[0m               = "getByDataType"
          [32m+[0m [0m[1m[0mnon_key_attributes[0m[0m = [
              [32m+[0m [0m"idolIdentifer",
            ]
          [32m+[0m [0m[1m[0mprojection_type[0m[0m    = "INCLUDE"
          [32m+[0m [0m[1m[0mrange_key[0m[0m          = "dataValue"
        }
      [32m+[0m [0mglobal_secondary_index {
          [32m+[0m [0m[1m[0mhash_key[0m[0m           = "dataValue"
          [32m+[0m [0m[1m[0mname[0m[0m               = "getByDataValue"
          [32m+[0m [0m[1m[0mnon_key_attributes[0m[0m = []
          [32m+[0m [0m[1m[0mprojection_type[0m[0m    = "ALL"
          [32m+[0m [0m[1m[0mrange_key[0m[0m          = "idolIdentifer"
        }

      [33m~[0m [0mpoint_in_time_recovery {
          [33m~[0m [0m[1m[0menabled[0m[0m = false [33m->[0m [0m(known after apply)
        }

      [32m+[0m [0mserver_side_encryption {
          [32m+[0m [0m[1m[0menabled[0m[0m     = (known after apply)
          [32m+[0m [0m[1m[0mkms_key_arn[0m[0m = (known after apply)
        }

      [33m~[0m [0mttl {
          [32m+[0m [0m[1m[0mattribute_name[0m[0m = (known after apply)
          [33m~[0m [0m[1m[0menabled[0m[0m        = false [33m->[0m [0m(known after apply)
        }
    }

[0m[1mPlan:[0m 1 to add, 0 to change, 1 to destroy.
[0m[0m[1maws_dynamodb_table.idol_table: Destroying... [id=idolGroupList][0m[0m
[0m[1maws_dynamodb_table.idol_table: Destruction complete after 8s[0m
[0m[1maws_dynamodb_table.idol_table: Creating...[0m[0m
[0m[1maws_dynamodb_table.idol_table: Still creating... [10s elapsed][0m[0m
[0m[1maws_dynamodb_table.idol_table: Still creating... [20s elapsed][0m[0m
[0m[1maws_dynamodb_table.idol_table: Creation complete after 24s [id=idolGroupList][0m
[0m[1m[32m
Apply complete! Resources: 1 added, 0 changed, 1 destroyed.
[0m```

</details>

*Pusher: @scarlet0725, Action: `pull_request`, Workflow: `Terraform Apply`*